PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_scb_spi.c
                            if (!Cy_SCB_SPI_IsBusBusy(locBase))
                            {
                                retStatus = CY_SYSPM_SUCCESS;
                            }
                        }
                        else
                        {
                            /* The SCB is NOT wakeup-capable: disable the
                            * SPI. The master and slave stop driving the
                            * bus until the SPI is enabled. This happens
                            * when the device fails to enter Deep Sleep
                            * mode or it is awakened from Deep Sleep mode.
                            */
                            Cy_SCB_SPI_Disable(locBase, locContext);

                            retStatus = CY_SYSPM_SUCCESS;
                        }
                    }
                }
            }
        }
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        /* The other driver is not ready for Deep Sleep mode. Restore
        * Active mode configuration.
        */

        if (!_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* The SCB is NOT wakeup-capable: enable the SPI to operate */
            Cy_SCB_SPI_Enable(locBase);
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    {
        /* This code executes inside the critical section and enabling the
        * active interrupt source makes the interrupt pending in the NVIC.
        * However, the interrupt processing is delayed until the code exits
        * the critical section. The pending interrupt force WFI instruction
        * does nothing and the device remains in Active mode.
        */

        if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* The SCB is wakeup-capable: enable the SPI wakeup interrupt
            * source. If any transaction happens, the wakeup interrupt
            * becomes pending and prevents entering Deep Sleep mode.
            */
            Cy_SCB_SetSpiInterruptMask(locBase, CY_SCB_I2C_INTR_WAKEUP);

            /* Disable SCB clock */
            SCB_I2C_CFG(locBase) &= (uint32_t) ~CY_SCB_I2C_CFG_CLK_ENABLE_Msk;

            /* IMPORTANT (replace line above for the CY8CKIT-062 rev-08):
            * for proper entering Deep Sleep mode the SPI clock must be disabled.
            * This code must be inserted by the user because the driver
            * does not have access to the clock.
            */
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_AFTER_TRANSITION:
    {
        if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* Enable SCB clock */
            SCB_I2C_CFG(locBase) |= CY_SCB_I2C_CFG_CLK_ENABLE_Msk;

            /* IMPORTANT (replace line above for the CY8CKIT-062 rev-08):
            * for proper exiting Deep Sleep mode, the SPI clock must be enabled.
            * This code must be inserted by the user because the driver
            * does not have access to the clock.
            */

            /* The SCB is wakeup-capable: disable the SPI wakeup interrupt
            * source
            */
            Cy_SCB_SetSpiInterruptMask(locBase, CY_SCB_CLEAR_ALL_INTR_SRC);
        }
        else
        {
            /* The SCB is NOT wakeup-capable: enable the SPI to operate */
            Cy_SCB_SPI_Enable(locBase);
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (retStatus);
}


/*******************************************************************************
* Function Name: Cy_SCB_SPI_HibernateCallback
****************************************************************************//**
*
* This function handles the transition of the SCB SPI into Hibernate mode.
* It prevents the device from entering Hibernate mode if the SPI slave or
* master is actively communicating, or there is any data in the TX or RX FIFOs.
* If the SPI is ready to enter Hibernate mode, it is disabled. If the device
* failed to enter Hibernate mode, the SPI is re-enabled. While the SPI is
* disabled, it stops driving the outputs and ignores the inputs. Any incoming
* data is ignored. Refer to section \ref group_scb_spi_lp for more information
* about SPI pins when SCB disabled.
*
* This function must be called during execution of \ref Cy_SysPm_SystemEnterHibernate.
* To do it, register this function as a callback before calling
* \ref Cy_SysPm_SystemEnterHibernate : specify \ref CY_SYSPM_HIBERNATE as the callback
* type and call \ref Cy_SysPm_RegisterCallback.
*
* \param callbackParams
* The pointer to the callback parameters structure
* \ref cy_stc_syspm_callback_params_t.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SCB_SPI_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    CySCB_Type *locBase = (CySCB_Type *) callbackParams->base;
    cy_stc_scb_spi_context_t *locContext = (cy_stc_scb_spi_context_t *) callbackParams->context;

    cy_en_syspm_status_t  retStatus = CY_SYSPM_FAIL;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        /* Check whether the High-level API is not busy executing the transfer
        * operation.
        */
        if (0UL == (CY_SCB_SPI_TRANSFER_ACTIVE & Cy_SCB_SPI_GetTransferStatus(locBase, locContext)))
        {
            /* If the SPI bus is not busy, all data elements are transferred
            * on the bus from the TX FIFO and shifter and the RX FIFOs are
            * empty - the SPI is ready to enter Hibernate mode.
            */
            if (!Cy_SCB_SPI_IsBusBusy(locBase))
            {
                if (Cy_SCB_SPI_IsTxComplete(locBase))
                {
                    if (0UL == Cy_SCB_SPI_GetNumInRxFifo(locBase))
                    {
                        /* Disable the SPI. The master or slave stops
                        * driving the bus until the SPI is enabled.
                        * This happens if the device failed to enter
                        * Hibernate mode.
                        */
                        Cy_SCB_SPI_Disable(locBase, locContext);

                        retStatus = CY_SYSPM_SUCCESS;
                    }
                }
            }
        }
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        /* The other driver is not ready for Hibernate mode. Restore Active
        * mode configuration.
        */

        /* Enable the SPI to operate */
        Cy_SCB_SPI_Enable(locBase);

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    case CY_SYSPM_AFTER_TRANSITION:
    {
        /* The SCB is not capable of waking up from Hibernate mode:
        * do nothing.
        */
        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (retStatus);
}


/************************* High-Level Functions ********************************
* The following functions are considered high-level. They provide the layer of
* intelligence to the SCB. These functions require interrupts.
* Low-level and high-level functions must not be mixed because low-level API
* can adversely affect the operation of high-level functions.
*******************************************************************************/


